/***
 * **
 * 范文捷:
 * 明白了，取均值。这道题我会，4年前面试字节跳动时，就给我出过一道题，多通道simd求均值并四舍五入
 *
 * 傻狍子:
 * 在校生小白在偷偷观察
 *
 * 范文捷:
 * 思路不是加，我先写伪代码
 * y1=x1 ^ x2
 * y2=y1&vec4(0x01010101)
 * y=(x1&x2)+y2+(y1>>1&vec4(0x7f7f7f7f))
 *
 * */
#include <stdio.h>
#include <stdint.h>

uint32_t avg(uint32_t x1, uint32_t x2)
{
	    return (x1 | x2) - (((x1 ^ x2) & 0xFEFEFEFEU) >> 1U);
}

int main(void)
{
	    uint8_t a[] = { 32, 97, 245, 223,170,67,122,223,242,77,59,194,71,235,3,186};
	        uint8_t b[] = { 78, 27, 221, 2,184,189,140,248,118,112,129,178,121,232,86,24};

		//期望输出
		//    uint8_t c[] = {55, 62, 233, 113, 177, 128, 131, 236, 180, 95, 94, 186, 96, 234, 45, 105};
		    uint8_t c[16] = { 0 };
		        for (int i = 0; i < 4; ++i)
				    {
					            ((uint32_t*)c)[i] = avg(((uint32_t*)a)[i], ((uint32_t*)b)[i]);
						        }
			    for (int i = 0; i < sizeof(c) / sizeof(*c); ++i)
				            printf("%d\n", c[i]);
			        return 0; 
}
